{"class_name": "Model", "keras_version": "2.2.4", "config": {"output_layers": [["main_output", 0, 0], ["aux_output", 0, 0]], "name": "model_1", "input_layers": [["sequence_input", 0, 0], ["non_sequence_input", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "sequence_input", "config": {"dtype": "float32", "batch_input_shape": [null, 20, 1], "sparse": false, "name": "sequence_input"}, "inbound_nodes": []}, {"class_name": "LSTM", "name": "lstm_4", "config": {"use_bias": true, "bias_regularizer": null, "implementation": 1, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "return_sequences": false, "trainable": true, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_4", "activation": "tanh", "kernel_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "bias_constraint": null, "units": 100, "return_state": false, "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null}, "inbound_nodes": [[["sequence_input", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "non_sequence_input", "config": {"dtype": "float32", "batch_input_shape": [null, 6], "sparse": false, "name": "non_sequence_input"}, "inbound_nodes": []}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["lstm_4", 0, 0, {}], ["non_sequence_input", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_21", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 40, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_21", "activation": "relu", "kernel_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_8", "config": {"noise_shape": null, "trainable": true, "name": "dropout_8", "rate": 0.5, "seed": null}, "inbound_nodes": [[["dense_21", 0, 0, {}]]]}, {"class_name": "Dense", "name": "main_output", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "main_output", "activation": "softmax", "kernel_constraint": null}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"class_name": "Dense", "name": "aux_output", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "aux_output", "activation": "softmax", "kernel_constraint": null}, "inbound_nodes": [[["lstm_4", 0, 0, {}]]]}]}, "backend": "tensorflow"}