{"config": {"name": "model_35", "output_layers": [["main_output", 0, 0], ["aux_output", 0, 0]], "input_layers": [["sequence_input", 0, 0], ["non_sequence_input", 0, 0]], "layers": [{"config": {"name": "sequence_input", "batch_input_shape": [null, 20, 1], "dtype": "float32", "sparse": false}, "name": "sequence_input", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"recurrent_dropout": 0.0, "return_sequences": false, "go_backwards": false, "implementation": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "units": 100, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "unit_forget_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "return_state": false, "stateful": false, "activation": "tanh", "use_bias": true, "name": "lstm_26", "dropout": 0.0, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_constraint": null, "unroll": false, "recurrent_constraint": null}, "name": "lstm_26", "inbound_nodes": [[["sequence_input", 0, 0, {}]]], "class_name": "LSTM"}, {"config": {"name": "non_sequence_input", "batch_input_shape": [null, 6], "dtype": "float32", "sparse": false}, "name": "non_sequence_input", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"name": "concatenate_35", "axis": -1, "trainable": true}, "name": "concatenate_35", "inbound_nodes": [[["lstm_26", 0, 0, {}], ["non_sequence_input", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"trainable": true, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "dense_107", "use_bias": true, "units": 40, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "activity_regularizer": null, "bias_constraint": null}, "name": "dense_107", "inbound_nodes": [[["concatenate_35", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"name": "dropout_75", "trainable": true, "seed": null, "rate": 0.5, "noise_shape": null}, "name": "dropout_75", "inbound_nodes": [[["dense_107", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "main_output", "use_bias": true, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "name": "main_output", "inbound_nodes": [[["dropout_75", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "name": "aux_output", "use_bias": true, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null}, "name": "aux_output", "inbound_nodes": [[["lstm_26", 0, 0, {}]]], "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow"}