{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_55", "layers": [{"class_name": "LSTM", "config": {"activation": "relu", "return_state": false, "units": 256, "name": "lstm_29", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "recurrent_dropout": 0.0, "trainable": true, "return_sequences": false, "implementation": 1, "kernel_constraint": null, "recurrent_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "use_bias": true, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "dtype": "float32", "unroll": false, "activity_regularizer": null, "batch_input_shape": [null, 1, 19], "unit_forget_bias": true, "bias_regularizer": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_88", "noise_shape": null, "rate": 0.25, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "name": "dense_164", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "units": 128, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_89", "noise_shape": null, "rate": 0.4, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "name": "dense_165", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "units": 64, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_90", "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "name": "dense_166", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "units": 10, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}]}}