{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "LSTM", "config": {"use_bias": true, "bias_regularizer": null, "implementation": 1, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "return_sequences": false, "trainable": true, "kernel_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "activation": "relu", "kernel_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "bias_constraint": null, "units": 256, "dtype": "float32", "return_state": false, "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "batch_input_shape": [null, 1, 19], "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_3", "rate": 0.25, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9", "activation": "relu", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_4", "rate": 0.4, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_10", "activation": "relu", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_5", "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_11", "activation": "softmax", "kernel_constraint": null}}], "name": "sequential_3"}, "backend": "tensorflow"}