{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0010000000474974513, "l2": 0.0}}, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "batch_input_shape": [null, 26], "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0010000000474974513, "l2": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activation": "relu", "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0010000000474974513, "l2": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "activation": "relu", "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "activation": "softmax", "kernel_constraint": null}}], "name": "sequential_1"}, "backend": "tensorflow"}